yunshu-drwells/SmartOffice/SmartOffice/Src/esp8266_web.c
#include "esp8266.h"  //ESP8266_Enable
#include "esp8266_web.h"  //enum
#include "stdint.h"
#include "usart.h"  //huart1
#include "main.h"   //RX_BUFFER_SIZE MAX_IP_LENGTH uart3_rx_buffer
#include "string.h" //strcmp memset
#include "delay.h"  //delay_ms

// 定义枚举类型
typedef enum {
    TCP,
    UDP
} enumTCP;

//extern uint8_t uart3_rx_buffer[];
extern volatile uint16_t uart3_rx_index;

void ESP8266_SendCmd(const char* str){
	//printf("send cmd\n");
	HAL_UART_Transmit(&huart3, (uint8_t*)str, strlen(str), HAL_MAX_DELAY);
}

static void ClearUart3ReceiveBuff(void){
	// 清空缓冲区
	memset(uart3_rx_buffer, 0, MAX_RX_BUFFER_SIZE);
	__HAL_UART_FLUSH_DRREGISTER(&huart3);  // 清空数据寄存器
	//Uart3FramFinishFlag = 0;  //接收完成标志置零
	uart3_rx_index = 0;
	
	// Re-enable UART1 receive interrupt
	// 重新开始接收数据
	if (HAL_UART_GetState(&huart3) == HAL_UART_STATE_READY)
	{
		HAL_UART_Receive_IT(&huart3, uart3_rx_buffer, MAX_RX_BUFFER_SIZE);
	}
	else
	{
		//printf("UART not ready to receive, aborting current receive operation\n");
		HAL_UART_AbortReceive_IT(&huart3);
		HAL_UART_Receive_IT(&huart3, uart3_rx_buffer, MAX_RX_BUFFER_SIZE);
	}
}
#include <stdio.h>
#include <string.h>

char ip_address[MAX_IP_LENGTH] = {0};

char* extract_ip_address(const char* input, char* ip_address, size_t max_length) {
    const char* start = strstr(input, "+CIFSR:STAIP,\"");
    if (start == NULL) {
        return NULL;
    }
    
    start += 14; // 跳过 "+CIFSR:STAIP,\""
    const char* end = strchr(start, '"');
    if (end == NULL) {
        return NULL;
    }
    
    size_t length = end - start;
    if (length >= max_length) {
        return NULL;
    }
    
    strncpy(ip_address, start, length);
    ip_address[length] = '\0';
    
    return ip_address;
}

#include "FreeRTOS.h" //TickType_t
#include "task.h"  //xTaskGetTickCount
#include <stdlib.h>  //atoi

static uint8_t ESP8266_WaitResponse(const char* expected_response, uint32_t timeout){
	//uint32_t startTime = HAL_GetTick();
	//while ((HAL_GetTick() - startTime) < timeout){
	TickType_t startTime = xTaskGetTickCount();
    while ((xTaskGetTickCount() - startTime) < pdMS_TO_TICKS(timeout)){
		if (__HAL_UART_GET_FLAG(&huart3, UART_FLAG_IDLE) != RESET) { //如果Uart3接收到了Esp8266的数据
			__HAL_UART_CLEAR_IDLEFLAG(&huart3);                            //接收标志置零

			//用于调试某个AT命令的返回值
			if(!strcmp(expected_response, "??")){
				printf("Uart3 Received data from ESP8266: %s\n", uart3_rx_buffer);  // 调试输出
				printf("Uart3 Received data length:%d\n", uart3_rx_index);
			}

			//printf("Uart3 Received data from ESP8266: %s\n", uart3_rx_buffer);  // 调试输出
			//printf("Uart3 Received data length:%d\n", uart3_rx_index);
			/*
			//调试或者打印都无法打印正确值，printf太耗时，会导致uart3接收失败
			for(uint8_t i = 0; i<10; i++){
				printf("uart3_rx_buffer[%d]: %d\n", (uint8_t)uart3_rx_buffer[i]);
			}
			*/
			//将ESP8266的数据转发给Uart1
			if(!strcmp(expected_response, (const char*)uart3_rx_buffer) || strstr((const char*)uart3_rx_buffer, expected_response)) {
				if(!strcmp(expected_response, "OK")){
					//解析ip地址
					/*
					AT+CIFSR
					+CIFSR:STAIP,"192.168.2.38"
					+CIFSR:STAMAC,"ec:fa:bc:8f:01:3a"

					OK
					*/
					if (extract_ip_address((const char*)uart3_rx_buffer, ip_address, MAX_IP_LENGTH) != NULL) {
						printf("Extracted IP address: %s\n", ip_address);
					} else {
						printf("Failed to extract IP address\n");
					}			
					//printf("identical \n");
				}
				//用于调试某个AT命令的返回值
				if(!strcmp(expected_response, "??")){
					printf("identical \n");
				}
				ClearUart3ReceiveBuff();
				//printf("identical \n");
				return 1;
			} 
			ClearUart3ReceiveBuff();
		 }
	}
	return 0;
}

/*
static void extractHTTPBody(char* response, char* extracted_ip) {
	printf("strlen(response):%d \n", strlen(response));
	printf("%s", response);
    // 解析响应，提取正文
    char* body_start = strstr(response, "\r\n\r\n");
    if (body_start != NULL) {
        body_start += 4; // 跳过"\r\n\r\n"
        char* body_end = strstr(body_start, "\r\nCLOSED");
        if (body_end != NULL) {
            int ip_length = body_end - body_start;
            if (ip_length < sizeof(extracted_ip)) {
                strncpy(extracted_ip, body_start, ip_length);
                extracted_ip[ip_length] = '\0';
                printf("Extracted IP: %s\n", extracted_ip);
            }
        }
    }
}
*/

uint8_t ESP8266_WaitResponseFor(const char* expected_response, uint32_t timeout){
	TickType_t startTime = xTaskGetTickCount();
    while ((xTaskGetTickCount() - startTime) < pdMS_TO_TICKS(timeout)){
		if (__HAL_UART_GET_FLAG(&huart3, UART_FLAG_IDLE) != RESET) { //如果Uart3接收到了Esp8266的数据
			__HAL_UART_CLEAR_IDLEFLAG(&huart3);                            //接收标志置零
			//这个标志的清除是为了准备接收下一帧数据。如果不清除，系统将无法检测到下一次的空闲状态，从而可能错过数据帧的结束。
			//用于调试某个AT命令的返回值
			
			if(!strcmp(expected_response, "??")){
				printf("Uart3 Received data from ESP8266: %s\n", uart3_rx_buffer);  // 调试输出
				printf("Uart3 Received data length:%d\n", uart3_rx_index);
				
			}
			//将ESP8266的数据转发给Uart1
			if(!strcmp(expected_response, (const char*)uart3_rx_buffer) || strstr((const char*)uart3_rx_buffer, expected_response)) {
				//用于调试某个AT命令的返回值
				if(!strcmp(expected_response, "??")){
					printf("strlen(uart3_rx_buffer):%d \n", strlen((char*)uart3_rx_buffer));
					printf("%s", uart3_rx_buffer);
					// 提取并打印HTTP响应正文
					/*
					extractHTTPBody((char*)uart3_rx_buffer, FAN_ip_address);
					if (strlen(FAN_ip_address)) {
						printf("HTTP Response Body:\n%s\n", FAN_ip_address);
					} else {
						printf("Failed to extract HTTP body\n");
					}
					*/
				}
				ClearUart3ReceiveBuff();
				//printf("identical \n");
				return 1;
			} 
			ClearUart3ReceiveBuff();
		 }
	}
	return 0;
}

static uint8_t ESP8266_AT_Test(void){
    const char* str = "AT\r\n";
    //HAL_UART_Transmit(&huart3, (uint8_t*)str, 4, HAL_MAX_DELAY);
	ESP8266_SendCmd(str);
	
	if (!ESP8266_WaitResponse("AT\r\n\r\nOK\r\n", 200))
    {
        printf("AT ERROR!\r\n");
        return 0;
    }
	printf("AT OK!\r\n");
	return 1;
}

/**
 * @brief 设置ESP8266为STA模式
 * @return 1 if successful, 0 if failed
 */
static uint8_t ESP8266_SetSTAMode(void)
{
    ESP8266_SendCmd("AT+CWMODE=1\r\n");
    if (!ESP8266_WaitResponse("AT+CWMODE=1\r\n\r\nOK\r\n", 1000))
    {
        //printf("Failed to set STA mode\r\n");
        return 0;
    }
	printf("Successed to set STA mode\r\n");
	return 1;
}

/**
 * @brief 断开可能存在的WiFi连接
 * @return 1 if successful, 0 if failed
 */
static uint8_t ESP8266_CWQAP(){
    ESP8266_SendCmd("AT+CWQAP\r\n");
    if (!ESP8266_WaitResponse("AT+CWQAP\r\n\r\nOK\r\n", 1000))
    {
        //printf("Failed to disconnect from AP\r\n");
        return 0;
    }
	printf("Successed to disconnect from AP\r\n");

    return 1;
}

/**
 * @brief 禁用自动连接
 * @return 1 if successful, 0 if failed
 */
/*
发送：
AT+CWAUTOCONN=0\r\n
接收：
AT+CWAUTOCONN=0\r\n\r\nOK\r\n
*/
uint8_t ESP8266_CWAUTOCONN(){
    ESP8266_SendCmd("AT+CWAUTOCONN=0\r\n");
    if (!ESP8266_WaitResponse("AT+CWAUTOCONN=0\r\n\r\nOK\r\n", 1000))
    {
        //printf("Failed to disable auto-connect\r\n");
        return 0;
    }
	printf("Successed to disable auto-connect\r\n");

    return 1;
}

/**
 * @brief 使ESP8266连接到指定的WiFi热点
 * @param ssid WiFi的SSID
 * @param password WiFi的密码
 * @return 1 if successful, 0 if failed
 */
/*
AT+CWJAP=\"%s\",\"%s\"\r\n", ssid, password
*/
uint8_t ESP8266_JoinAP(const char* ssid, const char* password)
{
    char cmd[128];
    
