yunshu-drwells/SmartOffice/SmartOffice/Src/esp8266_web.c
    // 1. 设置WiFi模式为Station模式
	//已经完成了
	
    // 2. 连接到指定的AP
    snprintf(cmd, sizeof(cmd), "AT+CWJAP=\"%s\",\"%s\"\r\n", ssid, password);
    ESP8266_SendCmd(cmd);
    
	/*
    if (!ESP8266_WaitResponse(cmd, 20000)) {
        printf("Failed to connect to AP\r\n");
        return 0;
    }
	*/
	
	if (!ESP8266_WaitResponse("WIFI CONNECTED\r\n", 20000)) {
        printf("Failed to connect to AP\r\n");
        return 0;
    }
	
    if (!ESP8266_WaitResponse("WIFI GOT IP\r\n", 10000)) {
        printf("Connection confirmation WIFI GOT IP failed\r\n");
        return 0;
    }
    
    if (!ESP8266_WaitResponse("\r\nOK\r\n", 5000)) {
        printf("Connection confirmation OK failed\r\n");
        return 0;
    }
	
	
    
    // 3. 查询IP地址以确认连接
    ESP8266_SendCmd("AT+CIFSR\r\n");
    if (!ESP8266_WaitResponse("OK", 5000)) {
        printf("Failed to get IP address\r\n");
        return 0;
    }
    
    printf("Successfully connected to AP\r\n");
    return 1;
}


/**
 * @brief 开启或关闭多连接
 * @param enable 1开启,0关闭
 * @return 1 if successful, 0 if failed
 */
static uint8_t ESP8266_Enable_MultipleId(int enable) {
    char command[20] = {0};
	snprintf(command, sizeof(command), "AT+CIPMUX=%d\r\n", enable);
    //printf("command %s\n", command);
    
    ESP8266_SendCmd(command);
	snprintf(command, sizeof(command), "AT+CIPMUX=%d\r\n\r\nOK\r\n", enable);
    // 等待响应
    if (!ESP8266_WaitResponse(command, 5000)) {
        printf("Failed to set Multiple %d\r\n", enable);
        return 0;
    }
	printf("Successfully set Multiple %d \r\n", enable);
    return 1;
}


/**
 * @brief 使ESP8266开启服务器模式
 * @return 1 if successful, 0 if failed
 */
static uint8_t _ESP8266_Enable_SERVER() {
    ESP8266_SendCmd("AT+CIPSERVER=1,80\r\n");
    // 等待响应 首次设置和第二次设置成功返回字符是不同的
    if (!ESP8266_WaitResponse("AT+CIPSERVER=1,80\r\n\r\nOK\r\n", 5000)){
		ESP8266_SendCmd("AT+CIPSERVER=1,80\r\n");
		if (!ESP8266_WaitResponse("AT+CIPSERVER=1,80\r\nno change\r\n\r\nOK\r\n", 5000)) {
			printf("Failed to set SERVER\r\n");
			return 0;
		}
    }
	printf("Successfully set SERVER\r\n");
    return 1;
}

/**
 * @brief 使ESP8266开启服务端模式
 * @return 1 if successful, 0 if failed
 */
/*
AT+CIPMUX=1
AT+CIPSERVER=1,80
*/
void ESP8266_Enable_SERVER(){
	//等待禁用ESP8266多连接成功
	while( ! ESP8266_Enable_MultipleId(1) );
	
	//等待设置为客户端模式成功
	while( ! _ESP8266_Enable_SERVER() );
}


/**
 * @brief 使ESP8266开启客户端模式
 * @return 1 if successful, 0 if failed
 */

static uint8_t _ESP8266_Enable_Client(){
	ESP8266_SendCmd("AT+CIPSERVER=0\r\n");
    // 等待响应
    if (!ESP8266_WaitResponse("AT+CIPSERVER=0\r\n\r\nOK\r\n", 5000)){
		printf("Failed to set Client\r\n");
		return 0;
    }
	printf("Successfully set Client\r\n");
    return 1;
}

/*
AT+CIPSERVER=0
AT+CIPMUX=0
*/
void ESP8266_Enable_Client(){
	//等待设置为客户端模式成功
	while( ! _ESP8266_Enable_Client() );
	
	//等待禁用ESP8266多连接成功
	while( ! ESP8266_Enable_MultipleId(0) );
}

/**
 * @brief 设置ESP8266服务器超时时间
 * @return 1 if successful, 0 if failed
 */
static uint8_t ESP8266_Enable_STO() {
    ESP8266_SendCmd("AT+CIPSTO=60\r\n");
    // 等待响应
    if (!ESP8266_WaitResponse("AT+CIPSTO=60\r\n\r\nOK\r\n", 5000)) {
        printf("Failed to set STO\r\n");
        return 0;
    }
	printf("Successfully set STO\r\n");
    return 1;
}

#include "web.h"  //webstinfo
/**
* @brief  ESP8266 连接wifi函数
 * @param ssid WiFi的SSID
 * @param password WiFi的密码 
* @retval 无
*/
void ESP8266_Connect_Wifi(const char* ssid, const char* password)
{
	//等待AT命令成功
	while( ! ESP8266_AT_Test() );
	
	//printf("webstinfo:%p\n", webstinfo);
	//printf("webstinfo->index_html_size:%u\n", webstinfo->index_html_size);
	//等待设置WiFi模式为STA成功
	while( ! ESP8266_SetSTAMode() );
	//等待断开可能存在的WiFi连接成功
	while( ! ESP8266_CWQAP() );
	//等待禁用自动连接成功
	while( ! ESP8266_CWAUTOCONN() );
	//等待成功连接到某个指定的wifi并获取ip地址
	while( ! ESP8266_JoinAP(ssid, password) );
  
	//等待开启ESP8266多连接成功
	while( ! ESP8266_Enable_MultipleId(1) );
	
	//等待设置为服务器模式成功
	while( ! _ESP8266_Enable_SERVER() );
	
	//等待设置服务器超时时间成功
	while( ! ESP8266_Enable_STO() );
}

/**
* @brief  ESP8266 处理网络请求数据
* @param  无
* @retval 无
*/
void ESP8266_CheckRecvData(void)
{
	if (__HAL_UART_GET_FLAG(&huart3, UART_FLAG_IDLE) != RESET) { //如果Uart3接收到了Esp8266的数据
		__HAL_UART_CLEAR_IDLEFLAG(&huart3);                            //接收标志置零

		printf("Uart3 Received data from ESP8266: %s\n", uart3_rx_buffer);  // 调试输出
		printf("Uart3 Received data length:%d\n", uart3_rx_index);
		//解析Fan ip地址
		/*
		char *pdest = strstr((char*)uart3_rx_buffer, "Fan:");
		if(pdest){
			strcpy(FAN_ip_address, pdest+4);
			printf("FAN_ip_address:%s\n", FAN_ip_address);
		}
		*/
		/*
		//解析web请求
		//POST /CMD/MasterLight_On HTTP/1.1
		//解析POST命令请求
		char cmd[16] = {0};
		char* POST = strstr((char*)uart3_rx_buffer, "POST /CMD/");
		char* end = strstr((char*)uart3_rx_buffer, "HTTP/");
		char* cmd_start = POST+10;
		char* cmd_end = strstr(cmd_start, " ");
		strncpy(cmd, POST+10, cmd_end-cmd_start);
		printf("cmd:%s", cmd);
		*/

		ClearUart3ReceiveBuff();
	 }
}

/*
FAN_ON
FAN_OFF

MasterLight_ON&R=<>&G=<>&B=<> (MasterLight_ON&R=255&G=255&B=255)
MasterLight_OFF

SpotLight_ON&R=<>&G=<>&B=<> (SpotLight_ON&R=255&G=255&B=255)
SpotLight_OFF
*/

/*
AT+CWMODE=1  //设置ESP8266为STA模式 
AT+CWQAP  //断开可能存在的WiFi连接
AT+CWAUTOCONN=0  //禁用自动连接
AT+CWJAP="Yunshu_Drwells","yzy@0203yzy@0203"  //连接到指定的AP
AT+CIFSR  //查询IP地址以确认连接
AT+CIPMUX=1  //使用多连接(可以同时处理多个TCP/UDP连接)
AT+CIPSERVER=1,80  //设置为服务器模式，并在指定端口（例如80）上监听
AT+CIPSTO=60  //设置服务器超时时间（单位：秒，0表示永不超时）影响的是TCP连接的保持时间
*/







/*
AT+CIPSTART=0,"UDP","255.255.255.255",8080
AT+CIPSEND=0,16
> DISCOVER_DEVICES

AT+CIPSTART=0,"UDP","255.255.255.255",8080  //0: 这是连接ID，用于标识多连接模式下的不同连接。所有接收到广播数据包的设备必须在该端口上监听，才能接收到数据。
AT+CIPSEND=0,16  // 发送16字节的数据
> DISCOVER_DEVICES  // 输入要发送的数据
*/

/*
// 发起UDP广播
sendATCommand("AT+CIPSTART=0,\"UDP\",\"255.255.255.255\",8080");
sendATCommand("AT+CIPSEND=0,16");
sendATCommand("Hello, IoT Devices!");
*/


// 发送广播消息
char sendBroadcastCmd[] = "AT+CIPSTART=0,\"UDP\",\"255.255.255.255\",8080\r\n";

