yunshu-drwells/SmartOffice/SmartOffice/Src/esp8266_web.c
/*
发送：
AT+CIPSTART=0,"UDP","255.255.255.255",8080
成功接收：
AT+CIPSTART=0,"UDP","255.255.255.255",8080
0,CONNECT

OK
*/
uint8_t _ESP8266_sendBroadcastCmd(){
	ESP8266_SendCmd(sendBroadcastCmd);
    // 等待响应
    if (!ESP8266_WaitResponseFor("OK", 5000)) {
        printf("Failed to send Broadcast Cmd\r\n");
        return 0;
    }
	printf("Successfully sent Broadcast Cmd\r\n");
    return 1;
}

/*
发送：
AT+CIPSEND=0,16
成功接收：
RX：AT+CIPSEND=0,16

OK
> 
*/
uint8_t _ESP8266_sendDataCmd(char* sendDataCmd){
	ESP8266_SendCmd(sendDataCmd);
    // 等待响应
    if (!ESP8266_WaitResponseFor(">", 5000)) {
        printf("Failed to send Data Cmd: %s\r\n", sendDataCmd);
        return 0;
    }
	printf("Successfully sent Data Cmd: %s\r\n", sendDataCmd);
    return 1;
}

/*
发送：
DISCOVER_DEVICES
成功接收：
ES

busy s...

Recv 16 bytes

SEND OK
*/
uint8_t _ESP8266_broadcastMessage(char* broadcastMessage){
	ESP8266_SendCmd(broadcastMessage);
    // 等待响应
    if (!ESP8266_WaitResponseFor("SEND OK", 5000)) {
        printf("Failed to send broadcast Message: %s\r\n", broadcastMessage);
        return 0;
    }
	printf("Successfully sent broadcast Message: %s\r\n", broadcastMessage);
    return 1;
}

/**
* @brief  ESP8266 发送广播消息
* @param  无
* @retval 无
*/
//通过广播发起请求，然后让所有物联网设备返回自己的设备名称和ip地址，最后再通过ip地址的建立tcp从而与子模块通信
//这样会损耗cpu性能，直接使用广播的方式对所有物联网设备进行控制
void ESP8266_sendBroadcastCmd(char* broadcastMessage)
{
	char sendDataCmd[18] = {0};
	sprintf(sendDataCmd, "AT+CIPSEND=0,%d\r\n", strlen(broadcastMessage));
	
	//等待 AT+CIPSEND=0,16 命令成功
	while( ! _ESP8266_sendDataCmd(sendDataCmd) );
	
	//等待 发送信息成功
	while( ! _ESP8266_broadcastMessage(broadcastMessage) );
}

//#include "esp8266_fan.h"  //GetFanModuleIP

/*
FAN_ON
FAN_OFF

MasterLight_ON&R=<>&G=<>&B=<> (MasterLight_ON&R=255&G=255&B=255)
MasterLight_OFF

SpotLight_ON&R=<>&G=<>&B=<> (SpotLight_ON&R=255&G=255&B=255)
SpotLight_OFF

CONNECT_NEW_WIFI&ssid=Yunshu_Drwells&pwd=yzy@0203yzy@0203
*/

void ESP8266_startBroadCastCmd(){
	//等待 AT+CIPSTART=0,"UDP","255.255.255.255",8080 命令成功
	while( ! _ESP8266_sendBroadcastCmd() );
}


/**
* @brief  ESP8266 连接新wifi函数
 * @param ssid WiFi的SSID
 * @param password WiFi的密码 
* @retval 无
*/
/*
AT+CWQAP\r\n
AT+CWAUTOCONN=0\r\n
AT+CWJAP=\"%s\",\"%s\"\r\n", ssid, password
*/
uint8_t ESP8266_Connect_New_Wifi(const char* ssid, const char* password)
{
	//等待断开可能存在的WiFi连接成功
	//while( ! ESP8266_CWQAP() );
	//等待禁用自动连接成功
	//while( ! ESP8266_CWAUTOCONN() );
	//等待成功连接到某个指定的wifi并获取ip地址
	if( ! ESP8266_JoinAP(ssid, password) ){
		//失败
		return 0;
	}else{  
		//能成功连接
		return 1;
	}
}


/**
* @brief  ESP8266 连接新wifi函数
 * @param ssid WiFi的SSID
 * @param password WiFi的密码 
* @retval 无
*/
void ESP8266_Connect_New_Wifi_ALL(const char* ssid, const char* password)
{
	/*
	//在连接新wifi之前统计所有物联网设备数
	uint8_t devices = ESP8266_Count_Devices();

	//等待成功连接到某个指定的wifi并获取ip地址
	if( ! ESP8266_Connect_New_Wifi(ssid, password) ){
		//失败
		//连接回默认wifi
		while(!ESP8266_Connect_New_Wifi(macUser_ESP8266_ApSsid, macUser_ESP8266_ApPwd));
	}else{  //能成功连接
	    //检查空闲的ip地址数是否大于所有的物联网设备数
		uint8_t ips = ESP8266_Count_Free_ips();
		if(devices >= ips){
			//无法满足要求
			//连接回默认wifi
			while(!ESP8266_Connect_New_Wifi(macUser_ESP8266_ApSsid, macUser_ESP8266_ApPwd));
		}else{
			//可以满足要求
			//连接回旧wifi
			while(!ESP8266_Connect_New_Wifi(macUser_ESP8266_ApSsid, macUser_ESP8266_ApPwd));
			//通知所有物联网设备连接新wifi
			//...
		}
	}
	*/
	//等待成功连接到某个指定的wifi并获取ip地址
	if( ! ESP8266_Connect_New_Wifi(ssid, password) ){
		//失败
		//连接回默认wifi
		while(!ESP8266_Connect_New_Wifi(macUser_ESP8266_ApSsid, macUser_ESP8266_ApPwd));
	}else{  //能成功连接
		printf("start connect to old wifi\n");
		//连接回默认wifi
		ESP8266_Connect_New_Wifi(macUser_ESP8266_ApSsid, macUser_ESP8266_ApPwd);
		printf("connected to old wifi\n");
		//开启广播
		//ESP8266_startBroadCastCmd();
		
		//通知所有物联网设备连接新wifi
		//发送广播消息，让所有的物联网设备连接新wifi
		char sendDataCmd[128] = {0};
		sprintf(sendDataCmd, "CONNECT_NEW_WIFI&ssid=%s&pwd=%s", ssid, password);
		ESP8266_sendBroadcastCmd(sendDataCmd);
		printf("message all\n");
		
		//再连接回新wifi
		ESP8266_Connect_New_Wifi(ssid, password);
		printf("connected new wifi\n");
		//开启广播
		//ESP8266_startBroadCastCmd();
	}
}

void ESP8266_Lora_SenCmd(const char* str){
	HAL_UART_Transmit(&huart6, (uint8_t*)str, strlen(str), HAL_MAX_DELAY);
	//ESP8266_sendBroadcastCmd(str);
}

void Lora_OpenDoor(){
	ESP8266_Lora_SenCmd("Open_Door");
}




void test(){
	//测试风扇、主灯、射灯
	//ESP8266_startBroadCastCmd();
	
	//char broadcastMessage[] = "MasterLight_ON&R=255&G=255&B=255";
	//发送广播
	//ESP8266_sendBroadcastCmd(broadcastMessage);
	//ESP8266_sendBroadcastCmd("MasterLight_ON&R=255&G=255&B=255");
	/*	
	ESP8266_sendBroadcastCmd("FAN_ON");
	ESP8266_sendBroadcastCmd("MasterLight_ON&R=255&G=255&B=255");
	ESP8266_sendBroadcastCmd("SpotLight_ON&R=255&G=255&B=255");

	ESP8266_sendBroadcastCmd("FAN_OFF");
	ESP8266_sendBroadcastCmd("MasterLight_OFF");
	ESP8266_sendBroadcastCmd("SpotLight_OFF");
	*/
	
	//测试电磁门锁
	//Lora_OpenDoor();
	
	//测试wifi
	//ESP8266_Connect_New_Wifi_ALL(macUser_ESP8266_ApSsid, macUser_ESP8266_ApPwd);
	ESP8266_Connect_New_Wifi_ALL("Yunshu_Drwells", "yzy@0203yzy@0203");
	
	
}


/**
* @brief  统计连接了当前wifi的物联网设备数
 * @param ssid WiFi的SSID
 * @param password WiFi的密码 
* @retval 无
*/
/*
uint8_t ESP8266_Count_Devices(){
	return 0;
}
*/


/*
static uint8_t parseResponse(char *response)
{
  uint8_t freeIPCount = 0;
  // 解析响应，提取空闲IP地址数量
  // 这里只是一个简单的示例，实际解析逻辑可能更复杂
  char *token = strtok(response, ",");
  while (token != NULL)
  {
    if (strstr(token, "+CWLAP:") != NULL)
    {
      // 提取空闲IP地址数量
      freeIPCount = atoi(strtok(NULL, ":"));
      char countStr[10];
      sprintf(countStr, "%d", freeIPCount);
    }
    token = strtok(NULL, ",");
  }
  return freeIPCount;
}
*/

/*
static uint8_t ESP8266_WaitResponse_ForCWLAP(const char* expected_response, uint32_t timeout){
	//uint32_t startTime = HAL_GetTick();
	//while ((HAL_GetTick() - startTime) < timeout){
	TickType_t startTime = xTaskGetTickCount();
    while ((xTaskGetTickCount() - startTime) < pdMS_TO_TICKS(timeout)){
		if (__HAL_UART_GET_FLAG(&huart3, UART_FLAG_IDLE) != RESET) { //如果Uart3接收到了Esp8266的数据
			__HAL_UART_CLEAR_IDLEFLAG(&huart3);                            //接收标志置零

			//用于调试某个AT命令的返回值
			if(!strcmp(expected_response, "OK")){
				printf("Uart3 Received data from ESP8266: %s\n", uart3_rx_buffer);  // 调试输出
				printf("Uart3 Received data length:%d\n", uart3_rx_index);
			}


			//将ESP8266的数据转发给Uart1
				if(!strcmp(expected_response, "OK")){		
					printf("identical \n");
				}

				ClearUart3ReceiveBuff();
				//printf("identical \n");
				return 1;
			} 
			ClearUart3ReceiveBuff();
		 }
	}
	return 0;
}
*/


/**
* @brief  获取所有可用的wifi
 * @param ssid WiFi的SSID
 * @param password WiFi的密码 
* @retval 无
*/
/*
uint8_t ESP8266_Get_Enable_Wifi(){
    ESP8266_SendCmd("AT+CWLAP\r\n");
	uint8_t res = ESP8266_WaitResponse_ForCWLAP("OK", 5000);
    if (!res) {
        printf("Failed to get free ip or no free ip\r\n");
        return 0;
    }
	printf("Successfully get free ip\r\n");
	return res;
}
*/

