yunshu-drwells/SmartOffice/SmartOffice/Src/esp8266_web.c
/*
static int findNthOccurrence(const char *str, char ch, int n) {
    const char *ptr = str;
    int count = 0;

    while (*ptr != '\0') {
        if (*ptr == ch) {
            count++;
            if (count == n) {
                return ptr - str; // 返回相对于字符串起始位置的偏移量
            }
        }
        ptr++;
    }

    return -1; // 没有找到第n个字符
}
*/

/*
static uint8_t ESP8266_WaitResponse_ForPING(const char* expected_response, uint32_t timeout){
	//uint32_t startTime = HAL_GetTick();
	//while ((HAL_GetTick() - startTime) < timeout){
	TickType_t startTime = xTaskGetTickCount();
    while ((xTaskGetTickCount() - startTime) < pdMS_TO_TICKS(timeout)){
		if (__HAL_UART_GET_FLAG(&huart3, UART_FLAG_IDLE) != RESET) { //如果Uart3接收到了Esp8266的数据
			__HAL_UART_CLEAR_IDLEFLAG(&huart3);                            //接收标志置零

			//用于调试某个AT命令的返回值
			if(!strcmp(expected_response, "OK")){
				printf("Uart3 Received data from ESP8266: %s\n", uart3_rx_buffer);  // 调试输出
				printf("Uart3 Received data length:%d\n", uart3_rx_index);
			}

			//将ESP8266的数据转发给Uart1
			if(!strcmp(expected_response, (const char*)uart3_rx_buffer) || strstr((const char*)uart3_rx_buffer, expected_response)) {
				if(!strcmp(expected_response, "OK")){		
					printf("identical \n");
				}

				ClearUart3ReceiveBuff();
				//printf("identical \n");
				return 1;
			} 
			ClearUart3ReceiveBuff();
		 }
	}
	return 0;
}
*/

/*
static uint8_t ESP8266_WaitResponse_ForARP(const char* expected_response, uint32_t timeout){
	//uint32_t startTime = HAL_GetTick();
	//while ((HAL_GetTick() - startTime) < timeout){
	TickType_t startTime = xTaskGetTickCount();
    while ((xTaskGetTickCount() - startTime) < pdMS_TO_TICKS(timeout)){
		if (__HAL_UART_GET_FLAG(&huart3, UART_FLAG_IDLE) != RESET) { //如果Uart3接收到了Esp8266的数据
			__HAL_UART_CLEAR_IDLEFLAG(&huart3);                            //接收标志置零

			//用于调试某个AT命令的返回值
			if(!strcmp(expected_response, "OK")){
				printf("Uart3 Received data from ESP8266: %s\n", uart3_rx_buffer);  // 调试输出
				printf("Uart3 Received data length:%d\n", uart3_rx_index);
			}

			//将ESP8266的数据转发给Uart1
			if(!strcmp(expected_response, (const char*)uart3_rx_buffer) || strstr((const char*)uart3_rx_buffer, expected_response)) {
				if(!strcmp(expected_response, "OK")){			
					printf("identical \n");
				}
				ClearUart3ReceiveBuff();
				//printf("identical \n");
				return 1;
			} 
			ClearUart3ReceiveBuff();
		 }
	}
	return 0;
}
*/

/**
 * @brief  发送 ARP 请求
 * @param  ip_address: 目标 IP 地址
 * @return 成功返回 1，失败返回 0
 */
/*
int sendARPRequest(const char *ip_address) {
    char cmd[50];
    sprintf(cmd, "AT+CIPARP=\"%s\"\r\n", ip_address);
    ESP8266_SendCmd(cmd);
    return ESP8266_WaitResponse_ForARP("OK", 1000);
}
*/


/**
* @brief  统计连接的当前wifi的空闲ip数量
 * @param 无
 * @return 空闲ip数
*/
/*
uint8_t ESP8266_Count_Free_ips(){
	 // 发送AT指令执行ping命令
    //sendATCommand("AT+PING=\"www.google.com\"\r\n");
	
	//获取已经使用的ip数量
	uint8_t usedIPs = 0;
	uint8_t freeIps = 0;
	char temp_ip_address[MAX_IP_LENGTH] = {0};
	strcpy(temp_ip_address, ip_address);
	char str[4];
	//192.168.2.38
	//找到第三个.的下标
	int index = findNthOccurrence(temp_ip_address, '.', 3);
	//AT命令
	//char cmd[26] = {0};
	for(uint8_t i=0; i<255; i++){  //[0:254]
		// 使用sprintf将uint8_t转换为字符串
		sprintf(str, "%u", i);
		strncpy(temp_ip_address+index+1, str, 4);

		//printf("%s\n", temp_ip_address);
		strcpy(cmd, "AT+PING=\"");
		strcat(cmd, temp_ip_address);
		strcat(cmd, "\"\r\n");
		//printf("%s", cmd);

		ESP8266_SendCmd(cmd);  //AT+PING=\"ip\"\r\n
		if (!ESP8266_WaitResponse_ForPING("OK", 5000)) {
			freeIps++;
		}else{
			usedIPs++;
		}

		//Ping速度太慢了
		
		//采用ARP 扫描
		if (!sendARPRequest(temp_ip_address)) {
            freeIps++;
        } else {
            usedIPs++;
        }
		//速度依然很慢，因此放弃对空闲ip数量的统计
		
	}
	printf("free ip counts:%d", freeIps);
	return freeIps;
}
*/


/*
static uint8_t ESP8266_WaitResponseForCIPSTART(const char* expected_response, uint32_t timeout){
	//uint32_t startTime = HAL_GetTick();
	//while ((HAL_GetTick() - startTime) < timeout){
	TickType_t startTime = xTaskGetTickCount();
    while ((xTaskGetTickCount() - startTime) < pdMS_TO_TICKS(timeout)){
		if (__HAL_UART_GET_FLAG(&huart3, UART_FLAG_IDLE) != RESET) { //如果Uart3接收到了Esp8266的数据
			__HAL_UART_CLEAR_IDLEFLAG(&huart3);                            //接收标志置零

			//用于调试某个AT命令的返回值
			if(!strcmp(expected_response, "??")){
				printf("Uart3 Received data from ESP8266: %s\n", uart3_rx_buffer);  // 调试输出
				printf("Uart3 Received data length:%d\n", uart3_rx_index);
			}

			//printf("Uart3 Received data from ESP8266: %s\n", uart3_rx_buffer);  // 调试输出
			//printf("Uart3 Received data length:%d\n", uart3_rx_index);

			//调试或者打印都无法打印正确值，printf太耗时，会导致uart3接收失败
			for(uint8_t i = 0; i<10; i++){
				printf("uart3_rx_buffer[%d]: %d\n", (uint8_t)uart3_rx_buffer[i]);
			}

			//将ESP8266的数据转发给Uart1
			if(!strcmp(expected_response, (const char*)uart3_rx_buffer) || strstr((const char*)uart3_rx_buffer, expected_response)) {
				if(!strcmp(expected_response, "OK")){
					//解析ip地址
					if (extract_ip_address((const char*)uart3_rx_buffer, ip_address, MAX_IP_LENGTH) != NULL) {
						printf("Extracted IP address: %s\n", ip_address);
					} else {
						printf("Failed to extract IP address\n");
					}			
					//printf("identical \n");
				}
				//用于调试某个AT命令的返回值
				if(!strcmp(expected_response, "??")){
					printf("identical \n");
				}
				ClearUart3ReceiveBuff();
				//printf("identical \n");
				return 1;
			} 
			ClearUart3ReceiveBuff();
		 }
	}
	return 0;
}
*/

/*
void send_broadcast_request(void)
{
    // 发送广播请求
	ESP8266_SendCmd("AT+CIPSTART=\"TCP\",\"255.255.255.255\",80");
	uint8_t res = ESP8266_WaitResponseForCIPSTART("OK", 5000);
    if (!res) {
        printf("Failed to get free ip or no free ip\r\n");
        return 0;
    }
	printf("Successfully get free ip\r\n");
	return res;
	
    send_at_command("AT+CIPSTART=\"TCP\",\"255.255.255.255\",80");
    HAL_Delay(1000); // 等待连接建立
    send_at_command("AT+CIPSEND=0,35");
    HAL_Delay(1000); // 等待发送准备
    const char* request = "GET /get_ip?msg=GET_IP HTTP/1.1\r\nHost: 255.255.255.255\r\nConnection: close\r\n";
    HAL_UART_Transmit(&huart3, (uint8_t*)request, strlen(request), HAL_MAX_DELAY);
}
*/


